# 13.1 Функции без параметров
""""""


"""
Напишите функцию draw_box(), которая выводит звездный прямоугольник с размерами  14 x 10
Output: 

**********
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
*        *
**********
"""

def draw_box():
    print("*" * 10)
    for _ in range(12):
        print("*        *")
    print("*" * 10)

draw_box()

# Вариант
def draw_box():
    for i in range(14):
        if i in [0, 13]:
          print("*" * 10)
        else:
          print("*        *")

draw_box()



"""
Напишите функцию draw_triangle(), которая выводит звездный прямоугольный треугольник с катетами, 
равными 10  в соответствии с образцом:
Output: 

*
**
***
****
*****
******
*******
********
*********
**********

"""

def draw_triangle():
    for el in range(1, 11):
        print("*" * el)

draw_triangle()
